In [1]:
# Importing Libraries

import sqlite3 as sql3
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [80]:
conn = sql3.connect('expense_tracker.db')

In [6]:
cursor = conn.cursor()

In [7]:
file = 'expenses1.csv'
df = pd.read_csv(file)
df

,vendor,date,description,meansofpayment,city,category,USD,currency,credit/debit,country,lcy,eur,tags,recurrence,Unnamed: 14,Unnamed: 15
0,waw-airport,9/19/18,food,cash,chicago,groceries,60.96,USD,debit,USA,8.16,2.92,salad,no,NaN,NaN
1,dorm,9/20/18,accomodation,cash,fremont,accomodation,420.00,USD,debit,USA,239.40,54.60,september,no,NaN,NaN
2,dorm,9/21/18,accomodation,cash,fremont,accomodation,660.00,USD,debit,USA,376.20,85.80,deposit,yes,NaN,NaN
3,bistro,9/22/18,food,cash,fremont,groceries,13.99,USD,debit,USA,7.97,1.82,salad,yes,NaN,groceries
4,biedronka,9/23/18,food,cash,fremont,groceries,14.89,USD,debit,USA,8.49,1.94,NaN,yes,NaN,accomodation
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
166,ina,3/4/19,gas,cash,Nashville,travel,100.00,NaN,debit,NaN,NaN,NaN,NaN,NaN,NaN,NaN
167,ice-skating,3/5/19,ice-skating,cash,Nashville,activities,120.00,NaN,debit,NaN,NaN,NaN,NaN,NaN,NaN,NaN
168,ina,3/6/19,gas,cash,Nashville,travel,200.00,NaN,debit,NaN,NaN,NaN,NaN,NaN,NaN,NaN
169,company,3/6/19,salary,cash,chicago,salary,1000.00,NaN,credit,NaN,NaN,NaN,NaN,NaN,NaN,NaN
170,coffee-shop,3/7/19,coffee,cash,Nashville,activities,12.00,NaN,debit,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 171 entries, 0 to 170
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   vendor          171 non-null    object
 1   date            171 non-null    object
 2   description     171 non-null    object
 3   meansofpayment  171 non-null    object
 4   city            171 non-null    object
 5   category        171 non-null    object
 6   USD             162 non-null    float64
 7   currency        76 non-null     object
 8   credit/debit    171 non-null    object
 9   country         81 non-null     object
 10  lcy             85 non-null     float64
 11  eur             85 non-null     float64
 12  tags            63 non-null     object
 13  recurrence      76 non-null     object
 14  Unnamed: 14     0 non-null      float64
 15  Unnamed: 15     13 non-null     object
dtypes: float64(4), object(12)
memory usage: 21.5+ KB

In [9]:
df.isnull().sum()

vendor              0
date                0
description         0
meansofpayment      0
city                0
category            0
USD                 9
currency           95
credit/debit        0
country            90
lcy                86
eur                86
tags              108
recurrence         95
Unnamed: 14       171
Unnamed: 15       158
dtype: int64

In [5]:
# ignoring the null values
attributes = ['hrk','vendor', 'date', 'description','meansofpayment','city', 'category', 'currency','country']
new_data = df[attributes]

In [8]:
new_data.rename(columns={'hrk': 'cost'}, inplace=True)
new_data

/var/folders/y0/5l57ym2573553zlkd56cz9w80000gn/T/ipykernel_36046/4007409240.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_data.rename(columns={'hrk': 'cost'}, inplace=True)

,cost,vendor,date,description,meansofpayment,city,category,currency,country
0,60.96,waw-airport,19.09.2018.,food,cash,warszaw,groceries,PLN,poland
1,420.00,dorm,20.09.2018.,accomodation,cash,poznan,accomodation,PLN,poland
2,660.00,dorm,20.09.2018.,accomodation,cash,poznan,accomodation,PLN,poland
3,13.99,bistro,21.09.2018.,food,cash,poznan,groceries,PLN,poland
4,14.89,biedronka,21.09.2018.,food,cash,poznan,groceries,PLN,poland
...,...,...,...,...,...,...,...,...,...
165,10.00,konzum,24.12.,food,credit-card,zagreb,groceries,NaN,NaN
166,100.00,ina,27.12.,gas,cash,zagreb,car,NaN,NaN
167,120.00,ice-skating,27.12.,ice-skating,cash,zagreb,activities,NaN,NaN
168,200.00,ina,27.12.,gas,cash,zagreb,car,NaN,NaN
169,12.00,coffee-shop,06.01.2019.,coffee,cash,zagreb,activities,NaN,NaN

In [81]:
# Creating the table 
sql_qry = """
CREATE TABLE userdata_lite(
  UID INTEGER PRIMARY KEY AUTOINCREMENT,
  email VARCHAR(45) NOT NULL,
  password VARCHAR(45) NOT NULL
);
"""

cursor.execute(sql_qry)

OperationalError: table userdata_lite already exists

In [73]:
query = """
INSERT INTO userdata(FirstName, LastName, email, state, country, password, phone) 
VALUES ('sripal', 'Nomula', 'srnomula@iu.edu', 'IN', 'US', 'password', '6692462594');
"""

cursor.execute(query)

In [12]:
# Inserting the data

new_data.to_sql('expense', conn, index=False, if_exists='replace')

170

In [76]:
res = cursor.execute('select * from userdata')

In [77]:
res.fetchall()

[(1,
  'sripal',
  'Nomula',
  'srnomula@iu.edu',
  'IN',
  'US',
  'password',
  '6692462594'),
 (2,
  'sripal',
  'Nomula',
  'srnomula@iu.edu',
  'IN',
  'US',
  'password',
  '6692462594')]

In [33]:
qry1 = """
CREATE TABLE Categories (
    CategoryID INTEGER PRIMARY KEY AUTOINCREMENT,
    Name VARCHAR(255) NOT NULL)

"""

qry2 = """
INSERT INTO Categories (Name) 
VALUES ('food'), ('accomodation'), ('activities'), ('travel'), ('groceries'), ('dining'), ('education'), ('online'), ('salary');
"""

qry3 = """
ALTER TABLE Categories 
RENAME COLUMN Name TO category;
"""

In [27]:
cursor.execute(qry2)

In [34]:
cursor.execute(qry3)

In [39]:
q1 = """CREATE TABLE PaymentMethods (
    PaymentMethodID INTEGER PRIMARY KEY AUTOINCREMENT,
    Method VARCHAR(255) NOT NULL);"""

q2 = """
INSERT INTO PaymentMethods (Method) VALUES ('cash'), ('credit-traveld'), ('coupon');
"""
cursor.execute(q1)

In [41]:
cursor.execute(q2)

In [44]:
q1 = """
CREATE TABLE Locations (
    LocationID INTEGER PRIMARY KEY AUTOINCREMENT,
    city VARCHAR(255) NOT NULL,
    country VARCHAR(255) NOT NULL
);
"""

In [45]:
cursor.execute(q1)

In [47]:
cursor.execute("""
INSERT INTO Locations (city, country) VALUES ('chicago', 'USA'), ('fremont', 'USA');
""")

In [63]:
cursor.execute("""
CREATE TABLE Transactions (
    TransactionID INTEGER PRIMARY KEY AUTOINCREMENT,
    Date DATE NOT NULL,
    CategoryID INT,
    PaymentMethodID INT,
    LocationID INT,
    Amount DECIMAL(10, 2),
    Details VARCHAR(255),
    UID INT,
    FOREIGN KEY (CategoryID) REFERENCES Categories(CategoryID),
    FOREIGN KEY (PaymentMethodID) REFERENCES PaymentMethods(PaymentMethodID),
    FOREIGN KEY (LocationID) REFERENCES Locations(LocationID),
    FOREIGN KEY (UID) REFERENCES userdata(UID) );
""")

In [59]:
cursor.execute("""drop table Transactions""")

In [51]:
cursor.execute("""
Alter table Transactions
ADD COLUMN UID INT;
""")

In [56]:
cursor.execute("PRAGMA foreign_keys = ON;")

In [64]:
q = """

INSERT INTO Transactions (Date, CategoryID, PaymentMethodID, LocationID, Amount, Details, UID) VALUES
('2018-09-19', 
(SELECT CategoryID FROM Categories WHERE category = 'food'), 
(SELECT PaymentMethodID FROM PaymentMethods WHERE Method = 'cash'), 
(SELECT LocationID FROM Locations WHERE city = 'chicago'), 
60.96, 'salad', 1);

"""
cursor.execute(q)

In [70]:
res = cursor.execute("select * from transactions")

In [71]:
res.fetchall()

[(1, '2018-09-19', 1, 1, 1, 60.96, 'salad', 1),
 (2, '2018-09-20', 2, 1, 2, 420, 'september', 1),
 (3, '2018-09-21', 2, 1, 2, 660, 'deposit', 1)]

In [68]:
q1 = """
INSERT INTO Transactions (Date, CategoryID, PaymentMethodID, LocationID, Amount, Details, UID) VALUES
('2018-09-20', 
(SELECT CategoryID FROM Categories WHERE category = 'accomodation'), 
(SELECT PaymentMethodID FROM PaymentMethods WHERE Method = 'cash'), 
(SELECT LocationID FROM Locations WHERE city = 'fremont'), 
420, 'september', 1);
"""

q2 = """
INSERT INTO Transactions (Date, CategoryID, PaymentMethodID, LocationID, Amount, Details, UID) VALUES
('2018-09-21', 
(SELECT CategoryID FROM Categories WHERE category = 'accomodation'), 
(SELECT PaymentMethodID FROM PaymentMethods WHERE Method = 'cash'), 
(SELECT LocationID FROM Locations WHERE city = 'fremont'), 
660, 'deposit', 1);
"""

In [69]:
cursor.execute(q1)
cursor.execute(q2)